#include "stdafx.h"
#include "Utilities.h"
#include "BO3 Defines.h"
#include "Aimbot.h"


BYTE Aim[] = { 0x46, 0x61, 0x74, 0x68, 0x65, 0x72, 0x4c, 0x65, 0x77, 0x69, 0x73, 0x20, 0x63, 0x61, 0x6e, 0x20, 0x73, 0x75, 0x63, 0x6b, 0x20, 0x69, 0x74, 0x21 };

#define M_PI       3.14159265358979323846
#define GET_ORIGIN(VecOut,pMatrix) {VecOut.x = pMatrix._41;VecOut.y = pMatrix._42;VecOut.z = pMatrix._43;};
#define GET_X(VecOut,pMatrix) {D3DXVec3Normalize(&VecOut,&D3DXVECTOR3(pMatrix._11,pMatrix._12,pMatrix._13));};
#define GET_Y(VecOut,pMatrix) {D3DXVec3Normalize(&VecOut,&D3DXVECTOR3(pMatrix._21,pMatrix._22,pMatrix._23));};
#define GET_Z(VecOut,pMatrix) {D3DXVec3Normalize(&VecOut,&D3DXVECTOR3(pMatrix._31,pMatrix._32,pMatrix._33));};

#define DotProduct(x,y)			((x)[0]*(y)[0]+(x)[1]*(y)[1]+(x)[2]*(y)[2])
#define VectorSubtract(a,b,c)	((c)[0]=(a)[0]-(b)[0],(c)[1]=(a)[1]-(b)[1],(c)[2]=(a)[2]-(b)[2])
#define VectorAdd(a,b,c)		((c)[0]=(a)[0]+(b)[0],(c)[1]=(a)[1]+(b)[1],(c)[2]=(a)[2]+(b)[2])
#define VectorCopy(a,b)			((b)[0]=(a)[0],(b)[1]=(a)[1],(b)[2]=(a)[2])
#define VectorCopy4(a,b)		((b)[0]=(a)[0],(b)[1]=(a)[1],(b)[2]=(a)[2],(b)[3]=(a)[3])
#define	VectorScale(v, s, o)	((o)[0]=(v)[0]*(s),(o)[1]=(v)[1]*(s),(o)[2]=(v)[2]*(s))
#define	VectorMA(v, s, b, o)	((o)[0]=(v)[0]+(b)[0]*(s),(o)[1]=(v)[1]+(b)[1]*(s),(o)[2]=(v)[2]+(b)[2]*(s))
#define VectorCmp(a,b)			(((a)[0]==(b)[0])&&((a)[1]==(b)[1])&&((a)[2]==(b)[2]))

#define VALID( x ) ( x != NULL && HIWORD( x ) )

typedef FLOAT vec_t;

class Vector
{
public:
	// Construction/destruction
	inline Vector(VOID) { }
	inline Vector(FLOAT X, FLOAT Y, FLOAT Z) { x = X; y = Y; z = Z; }
	inline Vector(double X, double Y, double Z) { x = (FLOAT)X; y = (FLOAT)Y; z = (FLOAT)Z; }
	inline Vector(int X, int Y, int Z) { x = (FLOAT)X; y = (FLOAT)Y; z = (FLOAT)Z; }
	inline Vector(const Vector& v) { x = v.x; y = v.y; z = v.z; }
	inline Vector(FLOAT rgfl[3]) { x = rgfl[0]; y = rgfl[1]; z = rgfl[2]; }

	// Operators
	inline Vector operator-(VOID) const { return Vector(-x, -y, -z); }
	inline int operator==(const Vector& v) const { return x == v.x && y == v.y && z == v.z; }
	inline int operator!=(const Vector& v) const { return !(*this == v); }
	inline Vector operator+(const Vector& v) const { return Vector(x + v.x, y + v.y, z + v.z); }
	inline Vector operator-(const Vector& v) const { return Vector(x - v.x, y - v.y, z - v.z); }
	inline Vector operator*(FLOAT fl) const { return Vector(x*fl, y*fl, z*fl); }
	inline Vector operator/(FLOAT fl) const { return Vector(x / fl, y / fl, z / fl); }

	// Methods
	inline VOID CopyToArray(FLOAT* rgfl) const { rgfl[0] = x, rgfl[1] = y, rgfl[2] = z; }
	inline FLOAT Length(VOID) const { return (FLOAT)sqrt(x*x + y*y + z*z); }
	operator FLOAT *() { return &x; } // Vectors will now automatically convert to FLOAT * when needed
	operator const FLOAT *() const { return &x; } // Vectors will now automatically convert to FLOAT * when needed
	inline Vector Normalize(VOID) const
	{
		FLOAT flLen = Length();
		if (flLen == 0) return Vector(0, 0, 1); // ????
		flLen = 1 / flLen;
		return Vector(x * flLen, y * flLen, z * flLen);
	}

	inline FLOAT Length2D(VOID) const { return (FLOAT)sqrt(x*x + y*y); }

	// Members
	vec_t x, y, z;
};
inline Vector operator*(FLOAT fl, const Vector& v) { return v * fl; }

class vec2
{
public:
	union {
		struct { FLOAT x, y; };
		struct { FLOAT s, t; };
		struct { FLOAT r, g; };
	};
	vec2() : x(0.0f), y(0.0f) {}
	~vec2() {}
	vec2(FLOAT num) : x(num), y(num) {}
	vec2(FLOAT x, FLOAT y) : x(x), y(y) {}
	vec2(const vec2 &u) : x(u.x), y(u.y) {}
	vec2& operator = (const vec2 &u) { x = u.x; y = u.y; return *this; }
	vec2 operator - () { return vec2(-x, -y); }
	FLOAT* operator & () { return (FLOAT*)this; };
	vec2& operator += (FLOAT num) { x += num; y += num; return *this; }
	vec2& operator += (const vec2 &u) { x += u.x; y += u.y; return *this; }
	vec2& operator -= (FLOAT num) { x -= num; y -= num; return *this; }
	vec2& operator -= (const vec2 &u) { x -= u.x; y -= u.y; return *this; }
	vec2& operator *= (FLOAT num) { x *= num; y *= num; return *this; }
	vec2& operator *= (const vec2 &u) { x *= u.x; y *= u.y; return *this; }
	vec2& operator /= (FLOAT num) { x /= num; y /= num; return *this; }
	vec2& operator /= (const vec2 &u) { x /= u.x; y /= u.y; return *this; }
	friend vec2 operator + (const vec2 &u, FLOAT num) { return vec2(u.x + num, u.y + num); }
	friend vec2 operator + (FLOAT num, const vec2 &u) { return vec2(num + u.x, num + u.y); }
	friend vec2 operator + (const vec2 &u, const vec2 &v) { return vec2(u.x + v.x, u.y + v.y); }
	friend vec2 operator - (const vec2 &u, FLOAT num) { return vec2(u.x - num, u.y - num); }
	friend vec2 operator - (FLOAT num, const vec2 &u) { return vec2(num - u.x, num - u.y); }
	friend vec2 operator - (const vec2 &u, const vec2 &v) { return vec2(u.x - v.x, u.y - v.y); }
	friend vec2 operator * (const vec2 &u, FLOAT num) { return vec2(u.x * num, u.y * num); }
	friend vec2 operator * (FLOAT num, const vec2 &u) { return vec2(num * u.x, num * u.y); }
	friend vec2 operator * (const vec2 &u, const vec2 &v) { return vec2(u.x * v.x, u.y * v.y); }
	friend vec2 operator / (const vec2 &u, FLOAT num) { return vec2(u.x / num, u.y / num); }
	friend vec2 operator / (FLOAT num, const vec2 &u) { return vec2(num / u.x, num / u.y); }
	friend vec2 operator / (const vec2 &u, const vec2 &v) { return vec2(u.x / v.x, u.y / v.y); }
};

#define ANGLE2SHORT(x) ((int)((x)*65536/360) & 65535)

short angle2short(FLOAT x) {
	return ((int)((x) * 65536 / 360) & 65535);
}

int short2angle(short x) {
	return ((x)*(360.0 / 65536));
}

///////////////////////////AW Structs//////////////////////

D3DXVECTOR3 SilentAngles;
BOOL GotVisible = FALSE;

class cRefdef
{
public:
	char _0x0000[4];
	WORD iWidth; //0x0004 
	WORD iHeight; //0x0006 
	char _0x0008[8];
	FLOAT fov_X; //0x0010 
	FLOAT fov_Y; //0x0014 
	D3DXVECTOR3 EyePos; //0x0018 
	D3DXVECTOR3 ViewAxis[3]; //0x0024 
};//Size=0x0440

class cEntity
{
public:
	char _0x0000[2]; //0x0000 
	short Valid; //0x0002 
	char _0x0004[16];
	D3DXVECTOR3 mPos; //0x0014 
	char _0x0020[76];
	BYTE unknown; //0x006C 
	BYTE isZomming; //0x006D 
	BYTE unknown1; //0x006E 
	BYTE mStand; //0x006F 
	char _0x0070[12];
	Vector mPos2; //0x007C 
	char _0x0088[24];
	D3DXVECTOR3 ViewAngle; //0x00A0 
	char _0x00AC[56];
	__int32 ClientNum; //0x00E4 
	char _0x00E8[60];
	BYTE Unknown; //0x0124 
	char _0x0125[2];
	BYTE WeaponID; //0x0127 
	char _0x0129[24];
	D3DXVECTOR3 mPos3; //0x0140 
	char _0x014C[24];
	D3DXVECTOR3 ViewAngle2; //0x0164 
	char _0x1CF[107];//0x170
	BYTE State;//0x1DB
	char _0x0170[156];
};//Size=0x020C

class CGS//chui d'accord, mais ce probleme la on devra le fixé tot ou tard, ya des gens tv 32cm devil ? jcrois pour l'instant on sais meme pas si sa marche donc autant test un truck sur ! ou on verra le text
{
public:
	char _0x0000[8];
	__int32 screenX; //0x0008 
	__int32 screenY; //0x000C 
	char _0x0010[20];
	char gametype[4]; //0x0024 
	char _0x0028[24];
};

class clientInfo_t
{
public:
	__int32 mNum; //0x0000 
	__int32 Valid; //0x0004 
	char _0x0008[4];
	__int32 mTeam; //0x000C 
	char _0x0010[48];
};

class PlayerNames
{
public:
	char _0x0000[4];
	__int16 mNum; //0x0004 
	char _0x0006[6];
	BYTE Unk; //0x000C 
	char _Unkz[2]; //0x000D 
	BYTE mTeam; //0x000F 
	char _0x0010[72];
	char mName[0x10]; //0x0058 
	char _0x0068[196];
};//Size=0x012C

class CG_t
{
public:
	BYTE cNum; //0x0000 
	char _0x0001[75];
	__int32 ServerTime; //0x004C 
	char _0x0050[356];
	D3DXVECTOR3 wAngles; //0x01B4 
	char _0x01C0[1664];

};

class UserCmd_t
{
public:
public:
	int ServerTime; //0x0000 
	int Button; //0x0004 
	int ViewAngle[3]; //0x0008 
	int WeaponID; //0x0014 
	int moveTonpere;//0x0018
	int MoveTaMere; //0x001C 
	char _0x0020[36];
};

class clientActive
{
public:

	char _0x0000[272];
	D3DXVECTOR3 RefAngles; //0x0110 
	char _0x011C[15436];
	D3DXVECTOR3 ViewAngles; //0x3D68 
	UserCmd_t cmds[128]; //0x03D74
	int CmdNum; //0x5F74 

	UserCmd_t* GetCmd(int index)
	{
		return &cmds[(index & 0x7F)];
	}
};
/////////////////////////////////////////////////

///////////////////GO Structs//////////////////////////
class GO_cRefdef
{
public:
	char _0x0000[8];
	__int32 iWidth; //0x0008 
	__int32 iHeight; //0x000C 
	FLOAT fov_X; //0x0010 
	FLOAT fov_Y; //0x0014 
	D3DXVECTOR3 EyePos; //0x0018 
	D3DXVECTOR3 ViewAxis[3]; //0x0024 
	char _0x0030[19276];
	D3DXVECTOR3 vAngleidk; //0x4B7C 
	D3DXVECTOR3 refView; //0x4B88 
	D3DXVECTOR3 vOrig; //0x4B94 
	D3DXVECTOR3 vOrig2; //0x4BA0 
	D3DXVECTOR3 refView1; //0x4BAC 
	char _0x4BB8[12];
	D3DXVECTOR3 refView2; //0x4BC4 
	char _0x4BD0[11376];
};

class GO_cEntity
{
public:
	char _0x0000[2];
	short Valid; //0x0002 
	char _0x0004[16];
	D3DXVECTOR3 mPos; //0x0014 
	D3DXVECTOR3 ViewAngles; //0x0020 
	char _0x002C[49];
	BYTE Zooming; //0x005D 
	BYTE iMenu; //0x005E 
	BYTE Pose; //0x005F 
	char _0x0060[12];
	D3DXVECTOR3 mPos2; //0x006C 
	char _0x0078[24];
	D3DXVECTOR3 ViewAngles1; //0x0090 
	char _0x009C[64];
	D3DXVECTOR3 mPos3; //0x00DC 
	char _0x00E8[24];
	D3DXVECTOR3 ViewAngles2; //0x0100 
	char _0x010C[127];
	BYTE WeaponID; //0x018B 
	char _0x018C[59];
	BYTE State; //0x01C7 
	char _0x01C8[632];
};

class GO_CGS
{
public:
	char _0x0000[8];
	__int32 screenX; //0x0008 
	__int32 screenY; //0x000C 
	char _0x0010[20];
	char gametype[4]; //0x0024 
	char _0x0028[304];
	char mapName[20]; //0x0158 
};//Size=0x016C

class GO_PlayerNames
{
public:
	char _0x0000[22];
	__int16 mNum; //0x0016 
	char _0x0018[2];
	BYTE mTeam; //0x001A 
	char _0x001B[56];
	char mName[16]; //0x0053 
	char _0x0063[989];
};

class GO_clientInfo_t
{
public:
	__int32 mNum; //0x0000 
	__int32 Valid; //0x0004 
	char _0x0008[4];
	__int32 mTeam; //0x000C 
	char _0x0010[1520];

};

class GO_CG_t
{
public:
	__int32 ServerTime; //0x0000 
	char _0x0004[376];
	__int32 cNum; //0x017C 
	char _0x0180[72];
	__int32 Health1; //0x01C8 
	char _0x01CC[4];
	__int32 Health2; //0x01D0 
	char _0x01D4[620];

};//Size=0x0440

class GO_UserCmd_t
{
public:
	int ServerTime; //0x0000 
	int Button; //0x0004 
	int ViewAngle[3]; //0x0008 
	int WeaponID; //0x0014 
	char _0x0018[4];
	int moveTonpere; //0x001C 
	char _0x0020[28];
}; //size=0x003C

class GO_clientActive
{
public:
	char _0x0000[156];
	D3DXVECTOR3 vOrigin; //0x009C 
	char _0x00A8[60];
	D3DXVECTOR3 RefAngles; //0x00E4 
	char _0x00F0[12768];
	D3DXVECTOR3 ViewAngles; //0x32D0 
	GO_UserCmd_t cmds[128]; // 0x32DC
	int CmdNum; // 0x50DC

	GO_UserCmd_t* GetCmd(int index)
	{
		return &cmds[(index & 0x7F)];
	}
};

/////////////////////////////////////////////////


///////////////////MW3 Structs//////////////////////////
class MW3_cRefdef//to check
{
public:
	char _0x0000[8];
	__int32 iWidth; //0x0008 
	__int32 iHeight; //0x000C 
	FLOAT fov_X; //0x0010 
	FLOAT fov_Y; //0x0014 
	D3DXVECTOR3 EyePos; //0x0018 
	D3DXVECTOR3 ViewAxis[3]; //0x0024 
	char _0x0030[19276];
	D3DXVECTOR3 vAngleidk; //0x4B7C 
	D3DXVECTOR3 refView; //0x4B88 
	D3DXVECTOR3 vOrig; //0x4B94 
	D3DXVECTOR3 vOrig2; //0x4BA0 
	D3DXVECTOR3 refView1; //0x4BAC 
	char _0x4BB8[12];
	D3DXVECTOR3 refView2; //0x4BC4 
	char _0x4BD0[11376];
};

class MW3_cEntity
{
public:
	char _0x0000[2];
	short Valid; //0x0002 
	char _0x0004[16];
	D3DXVECTOR3 mPos; //0x0014 
	D3DXVECTOR3 ViewAngles; //0x0020 
	char _0x002C[49];
	BYTE Zooming; //0x005D 
	BYTE iMenu; //0x005E 
	BYTE Pose; //0x005F 
	char _0x0060[12];
	D3DXVECTOR3 mPos2; //0x006C 
	char _0x0078[24];
	D3DXVECTOR3 ViewAngles1; //0x0090 
	char _0x009C[64];
	D3DXVECTOR3 mPos3; //0x00DC 
	char _0x00E8[24];
	D3DXVECTOR3 ViewAngles2; //0x0100 
	char _0x010C[131];
	BYTE WeaponID; //0x018F 
	char _0x0190[55];
	BYTE State; //0x01C7 
	char _0x01C8[632];
};

class MW3_CGS
{
public:
	char _0x0000[8];
	__int32 screenX; //0x0008 
	__int32 screenY; //0x000C 
	char _0x0010[20];
	char gametype[4]; //0x0024 
	char _0x0028[304];
	char mapName[20]; //0x0158 
};//Size=0x016C

class MW3_ClientInfo
{
public:
	__int32 Valid; //0x0000 
	char _0x0004[4];
	__int32 mNum; //0x0008 
	char mName[20]; //0x000C 
	char _0x0020[12];
	__int32 mTeam; //0x002C 
	char _0x0030[1040];
};

//clientInfo refdef- 0x1099

class MW3_CG_t
{
public:
	char _0x0000[336];
	__int32 cNum; //0x0150 
	char _0x0154[72];
	__int32 Health1; //0x019C 
	char _0x01A0[4];
	__int32 Health2; //0x01A4 
	char _0x01A8[664];
};

class MW3_UserCmd_t
{
public:
	int ServerTime; //0x0000 
	int Button; //0x0004 
	int ViewAngle[3]; //0x0008 
	int WeaponID; //0x0014 
	char _0x0018[4];
	int moveTonpere; //0x001C 
	char _0x0020[12];
};// Size;0x2C

class MW3_clientActive
{
public:
	char _0x0000[128];
	int ServerTime; //0x0080 
	char _0x0084[24];
	D3DXVECTOR3 vOrigin; //0x009C 
	char _0x00A8[56];
	D3DXVECTOR3 RefAngles; //0x00E0 
	char _0x00EC[13508]; //0x00EC 
	D3DXVECTOR3 ViewAngles; //0x35B0 
	MW3_UserCmd_t cmds[128]; //0x35BC
	int CmdNum; //0x4BBC 

	MW3_UserCmd_t * GetCmd(int Index)
	{
		return &cmds[(Index & 0x7F)];
	}

};

/////////////////////////////////////////////////


///////////////////BO2 Structs//////////////////////////
class BO2_cRefdef
{
public:
	char _0x0000[8];
	__int32 screenX; //0x0008 
	__int32 screenY; //0x000C 
	char _0x0010[20];
	FLOAT fov_X; //0x0024 
	FLOAT fov_Y; //0x0028 
	FLOAT fov_Z; //0x002C 
	char _0x0030[4];
	FLOAT TotalFov; //0x0034 
	D3DXVECTOR3 EyePos; //0x0038 
	char _0x0044[4];
	D3DXVECTOR3 ViewAxis[3]; //0x0048 
	char _0x0054[94284];
	D3DXVECTOR3 vAngleidk; //0x170A0 
	D3DXVECTOR3 vOrig; //0x170AC 
	D3DXVECTOR3 refView1; //0x170B8 
	char _0x170C4[280];
	D3DXVECTOR3 vAngleidk2; //0x171DC 
	D3DXVECTOR3 refView2; //0x171E8 
	char _0x171F4[16972];
};

/*
class BO2_cEntity
{
public:
char _0x0000[2];
short Valid; //0x0002
char _0x0004[40];
D3DXVECTOR3 mPos; //0x002C
char _0x0038[285];
BYTE Zooming; //0x0155
char _0x0156[1];
BYTE Pose; //0x0157
char _0x0158[16];
D3DXVECTOR3 mPos2; //0x0168
char _0x0174[116];
D3DXVECTOR3 mPos3; //0x01E8
char _0x01F4[195];
BYTE WeaponID; //0x02B7
char _0x02B8[180];
__int8 State; //0x036C //64
char _0x036D[7];
};//Size=0x0374
*/

class BO2_cEntity
{
public:
	char _0x0000[2];
	short Valid; //0x0002 
	char _0x0004[40];
	D3DXVECTOR3 mPos; //0x002C 
	char _0x0038[168];
	__int8 AliveZombie; //0x00E0 
	char _0x00E1[116];
	BYTE Zooming; //0x0155 
	char _0x0156[1];
	BYTE Pose; //0x0157 
	char _0x0158[16];
	D3DXVECTOR3 mPos2; //0x0168 
	char _0x0174[116];
	D3DXVECTOR3 mPos3; //0x01E8 
	char _0x01F4[195];
	BYTE WeaponID; //0x02B7 
	char _0x02B8[180];
	__int8 State; //0x036C //64
	char _0x036D[7];
};//Size=0x0374

class BO2_CGS
{
public:
	char _0x0000[8];
	__int32 screenX; //0x0008 
	__int32 screenY; //0x000C 
	char _0x0010[32];
	char gametype[20]; //0x0030 
};//Size=0x0500


class BO2_ClientInfo
{
public:
	__int32 Valid; //0x0000 
	char _0x0004[4];
	__int32 mNum; //0x0008 
	char mName[20]; //0x000C 
	char _0x0020[12];
	__int32 mTeam; //0x002C 
	char _0x0030[92];
	__int32 State; //0x008C 
	char _0x0090[64];
	DWORD State2; //0x00D0 
	char _0x00D4[876];
};

class BO2_CG_t
{
public:
	__int32 cNum; //0x0000 
	char _0x0001[711];
	__int32 Health; //0x02C8 
	char _0x02CC[4];
	__int32 Health2; //0x02D0 
	char _0x02D4[364];
};//Size=0x0440

class BO2_UserCMD
{
public:
	int ServerTime; //0x0000 
	int Button; //0x0004 
	int ViewAngle[3]; //0x0008 
	int WeaponID; //0x0014 
	char _0x0018[4];
	int moveTonpere; //0x001C 
	char _0x0020[38];
};//Size=0x0046

class BO2_clientActive
{
public:
	char _0x0000[152];
	D3DXVECTOR3 vOrigin; //0x0098 
	char _0x00A4[100];
	D3DXVECTOR3 RefAngles; //0x0108 
	char _0x0114[11128];
	D3DXVECTOR3 ViewAngles; //0x2C8C
	char _0x02C98[16];
	BO2_UserCMD cmds[128];//0x2CA8
	int CmdNum; // 0x4AA8

	BO2_UserCMD * GetCmd(int Index)
	{
		return &cmds[(Index & 0x7F)];
	}
};
/////////////////////////////////////////////////

///////////////////BO1 Structs//////////////////////////
class BO1_cRefdef
{
public:
	char _0x0000[8];
	__int32 iWidth; //0x0008 
	__int32 iHeight; //0x000C 
	char _0x0010[20];
	FLOAT fov_X; //0x0024 
	FLOAT fov_Y; //0x0028 
	FLOAT TotalFov; //0x002C 
	D3DXVECTOR3 EyePos; //0x0030 
	char _0x003C[4];
	D3DXVECTOR3 ViewAxis[3]; //0x0040 
	char _0x004C[1012];
};

class BO1_cEntity
{
public:
	char _0x0000[2];
	__int8 Valid; //0x0002 
	char _0x0003[45];
	D3DXVECTOR3 mPos; //0x0030 
	char _0x003C[320];
	D3DXVECTOR3 mPos2; //0x017C 
	char _0x0188[108];
	D3DXVECTOR3 mPos3; //0x01F4 
	char _0x0200[166];
	short WeaponID; //0x02A6 
	char _0x02A8[112];
	__int8 State; //0x0318 
	char _0x0319[295];
};

class BO1_CGS
{
public:
	char _0x0000[8];
	__int32 screenX; //0x0008 
	__int32 screenY; //0x000C 
	char _0x0010[32];
	char gametype[4]; //0x0030 
	char _0x0034[12];
};

class BO1_CG_t
{
public:
	__int32 cNum; //0x0000 
	char _0x0001[595];
	__int32 Health1; //0x0254 
	char _0x0258[4];
	__int32 Health2; //0x025C 
	char _0x0260[32];
};

class BO1_ClientInfo
{
public:
	__int32 Valid; //0x0000 
	char _0x0004[4];
	__int32 mNum; //0x0008 
	char mName[20]; //0x000C 
	char _0x0020[12];
	__int32 mTeam; //0x002C 
	char _0x0030[52];
	__int32 State; //0x0064 
	char _0x0068[40];
	DWORD State2; //0x0090 
	char _0x0094[1644];
};

class BO1_UserCmd
{
public:
	int servertime; // 0x0
	int buttons; // 0x4
	char Unknown001[0x4]; // 0x8
	int viewangles[3]; // 0xC
	char Unknown002[0x1C]; // 0x18
	int moveTonpere;//0x0018
};//size 0x34


class BO1_clientActive
{
public:
	char _0x0000[76];
	D3DXVECTOR3 vOrigin; //0x004C 
	char _0x0058[84];
	D3DXVECTOR3 RefAngles; //0x00AC 
	char _0x00B8[10120];
	D3DXVECTOR3 ViewAngles; //0x2840 
	char _0x284C[16]; //284C
	BO1_UserCmd cmds[128]; //0x285C
	int CurrentCmd; //0x425C


	BO1_UserCmd *GetUserCmd(int cmdNum)
	{
		int id = cmdNum & 0x7F;
		return &cmds[id];
	}
};
/////////////////////////////////////////////////

//MW2 STRUCTS

class playerState_sMW2
{
public:
	BYTE _0x0000[4];
	int cmdTime; // 0x0004
	BYTE _0x0008[88];
	Vector3 origin; // 0x0060
	Vector3 velocity; // 0x006C
	BYTE _0x0078[592];
	FLOAT weaponPosFraction; //0x02C8
}; // size: custom: 0x02CC

class MW2_CGS
{
public:
	char _0x0000[8];
	__int32 screenX; //0x0008 
	__int32 screenY; //0x000C 
	char _0x0010[16];
	char gametype[4]; //0x0020 
	char _0x0024[180572];
	playerState_sMW2 ps; // 0x2C180
	char _0x2C44C[242004];
	FLOAT aimSpreadScale; // 0x675A0
};

class MW2_CG_t
{
public:
	char _0x0000[260];
	__int32 cNum; //0x0104 
	char _0x0108[72];
	__int32 Health; //0x0150 
	char _0x0154[4];
	__int32 Health2; //0x0158 
	char _0x015C[24292];
};

class MW2_cEntity //SIZE 0x1F8
{
public:
	char _0x0000[2];
	__int8 Valid; //0x0002 
	char _0x0003[21];
	D3DXVECTOR3 mPos; //0x0018 
	char _0x0024[84];
	D3DXVECTOR3 mPos2; //0x0078 
	char _0x0084[112];
	D3DXVECTOR3 mPos3; //0x00F4 
	char _0x0100[156];
	WORD WeaponID; //0x019C 
	char _0x019E[50];
	__int32 State; //0x01D0 
	char _0x01D4[620];
};

class MW2_cRefdef
{
public:
	char _0x0000[8];
	__int32 iWidth; //0x0008 
	__int32 iHeight; //0x000C 
	FLOAT fov_X; //0x0010 
	FLOAT fov_Y; //0x0014 
	D3DXVECTOR3 EyePos; //0x0018 
	D3DXVECTOR3 ViewAxis[3]; //0x0024 
	char _0x0030[1040];
};

class MW2_UserCmd_t
{
public:
	int ServerTime; //0x0000 
	int Button; //0x0004 
	int ViewAngles[3]; //0x0008  
	int Weapon; //0x0014 
	int moveTonpere; //0x001C
	char _0x0018[12];
};//Size = 0x24

class MW2_clientActive
{
public:
	char _0x0000[128];
	__int32 ServerTime; //0x0080 
	char _0x0084[24];
	D3DXVECTOR3 vOrigin; //0x009C 
	char _0x00A8[56];
	D3DXVECTOR3 RefAngles; //0x00E0 
	char _0x00EC[12908];
	D3DXVECTOR3 ViewAngles; //0x3358 
	MW2_UserCmd_t cmds[128]; //0x3360 //1404 size total
	int CmdNum; //0x4764 

	MW2_UserCmd_t * GetCmd(int Index)
	{
		return &cmds[(Index & 0x7F)];
	}

};

class MW2_ClientInfo
{
public:
	__int32 Valid; //0x0000 
	char _0x0004[4];
	__int32 mNum; //0x0008 
	char mName[20]; //0x000C 
	char _0x0020[12];
	__int32 mTeam; //0x002C 
	char _0x0030[1040];
};

//////////////////////////////////


BOOL updateOffset = FALSE;

BOOL LastFrameAimKey = FALSE;
cEntity * pSavedTarget;
GO_cEntity * pSavedTarget1;
MW3_cEntity * pSavedTarget2;
BO1_cEntity * pSavedTarget3;
BO2_cEntity * pSavedTarget4;
MW2_cEntity * pSavedTarget5;

enum entity_type
{
	ET_GENERAL_MP = 0,
	ET_PLAYER_MP = 1,
	ET_PLAYER_CORPSE_MP = 2,
	ET_ITEM_MP = 3,
	ET_MISSILE_MP = 4,
	ET_INVISIBLE_MP = 5,
	ET_SCRIPTMOVER_MP = 6,
	ET_SOUND_BLEND_MP = 7,
	ET_FX_MP = 8,
	ET_LOOP_FX_MP = 9,
	ET_PRIMARY_LIGHT_MP = 10,
	ET_TURRET_MP = 11,
	ET_HELICOPTER_MP = 12,
	ET_PLANE_MP = 13,
	ET_VEHICLE_MP = 14,
	ET_VEHICLE_COLLMAP_MP = 15,
	ET_ZOMBIE_MP = 16,
	ET_VEHICLE_SPAWNER_MP = 17
};

#define __isync() __emit(0x4C00012C)
#define SYS_STRING "\\System??\\%s"
#define USR_STRING "\\??\\%s"

//HANDLE hThread; 
//DWORD hThreadId;
#define ROTY 0
#define ROTX 1
#define ROTZ 2

#define INI_NAME "\\XeCheats.ini"
DWORD BO2 = 0x415608C3;//BO2
